      功能: 注册成为网站会员
      为了能够浏览网站只对在线会员可见的那些内容
      作为一名访客
      我希望注册成为网站会员
      
          场景: 用户填写无效数据并注册
          当 我来到用户注册页面
          而且 我在输入框<用户名>中输入<invalid username>
          而且 我在输入框<电子邮箱>中输入<invalid email>
          而且 我在输入框<密码>中输入<password>
          而且 我在输入框<确认密码>中输入<verify password>
          而且 我按下<注册>按钮
          那么 我应该看到<注册失败>的提示信息
          
          场景: 用户填写正确的数据并注册
          当 我来到用户注册页面
          而且 我在输入框<用户名>中输入<404>
          而且 我在输入框<电子邮箱>中输入<xuliicom@gmail.com>
          而且 我在输入框<密码>中输入<password>
          而且 我在输入框<确认密码>中输入<password>
          而且 我按下<注册>按钮
          那么 我应该看到<注册成功>的提示信息

          场景: 用户填写正确的用户名和无效的邮件地址并注册
          当 我来到用户注册页面
          而且 我在输入框<用户名>中输入<woody>
          而且 我在输入框<电子邮箱>中输入<invalid email>
          而且 我在输入框<密码>中输入<password>
          而且 我在输入框<确认密码>中输入<password>
          而且 我按下<注册>按钮
          那么 我应该看到<注册失败>的提示信息
