blogcoders/app/controllers/blogs_controller.rb

  def create
    @post = Post.new(params[:post])
    if @post.save
---
INSERT INTO `posts` (`created_at`, `title`, `updated_at`, `content`) VALUES('2009-09-02 10:07:35', 'hhh', '2009-09-02 10:07:35', 'hhhhh')

  def update
    @blog = Post.find(params[:id])
    if @blog.update_attributes(params[:post])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
UPDATE `posts` SET `content` = 'test', `updated_at` = '2009-09-02 10:26:40', `title` = 'test' WHERE `id` = 16