app/controllers/pages_controller.rb

  def show
	@page = Page.find(params[:id].to_i)
---
SELECT * FROM `pages` WHERE (`pages`.`id` = 1)

  def create
	@page = Page.new(params[:page])
	@page.save!
---
INSERT INTO `pages` (`permalink`, `created_at`, `title`, `body`, `updated_at`) VALUES('test', '2009-08-28 09:21:45', 'test', 'test pages.', '2009-08-28 09:21:45')

  def edit
	@page = Page.find(params[:id].to_i)
---
SELECT * FROM `pages` WHERE (`pages`.`id` = 2)

  def update
	@page = Page.find(params[:id].to_i)
	@page.attributes = params[:page]
	@page.save!
---
SELECT * FROM `pages` WHERE (`pages`.`id` = 2)
UPDATE `pages` SET `updated_at` = '2009-08-28 09:26:47', `body` = 'This is test pages.' WHERE `id` = 2

  def destroy
	@page = Page.find(params[:id].to_i)
	if @page.destroy
---
SELECT * FROM `pages` WHERE (`pages`.`id` = 2)
DELETE FROM `pages` WHERE `id` = 2