app/controllers/users_controller.rb

INSERT INTO `users` (`encrypted_password`, `created_at`, `updated_at`, `username`, `password_salt`, `email`) VALUES(NULL, '2009-09-09 05:41:39', '2009-09-09 05:41:39', 'orange', NULL, 'orange@gmail.com')
---
      def create
        @user = User.new(params[:user])
        if @user.save