demo/app/controllers/users_controller.rb

INSERT INTO `users` (`encrypted_password`, `created_at`, `updated_at`, `username`, `password_salt`, `email`) VALUES(NULL, '2009-09-08 07:53:49', '2009-09-08 07:53:49', 'woody', NULL, 'unix1983@gmail.com')
---
  def create
	@user = User.new(params[:user])
	  if @user.save